package org.parog.session1;

/**
 * Вы играете в интересную стратегию. У вашего соперника остались всего одна казарма — здание, в котором постоянно
 * появляются новые солдаты. Перед атакой у вас есть x солдат. За один раунд каждый солдат может убить одного из
 * солдат противника или нанести 1 очко урона казарме (вычесть единицу здоровья у казармы). Изначально у вашего оппонента нет солдат.
 * Тем не менее его казарма имеет y единиц здоровья и производит p солдат за раунд.
 * <p>
 * Ход одного раунда:
 * <p>
 * 1. Каждый солдат из вашей армии либо убивает одного из солдат вашего противника, либо наносит 1 очко урона казарме.
 * Каждый солдат может выбрать своё действие. Когда казарма теряет все свои единицы здоровья, она разрушается.
 * 2. Ваш противник атакует. Он убьет k ваших солдат, где k — количество оставшихся у противника солдат.
 * 3. Если казармы еще не разрушены, ваш противник производит p новых солдат.
 * <p>
 * Ваша задача — разрушить казарму и убить всех солдат противника. Если это возможно, посчитайте минимальное количество
 * раундов, которое вам нужно для этого. В противном случае выведите-1.
 */
public class TaskG {
    public static void main(String[] args) {

    }
}
