package org.parog.session1;

/**
 * Вася и Маша участвуют в субботнике и красят стволы деревьев в белый цвет.
 * Деревья растут вдоль улицы через равные промежутки в 1 метр. Одно из деревьев обозначено числом ноль, деревья по одну
 * сторону занумерованы положительными числами 1,2 и т.д., а в другую — отрицательными −1,−2 и т.д.
 * <p>
 * Ведро с краской для Васи установили возле дерева P, а для Маши — возле дерева Q. Ведра с краской очень
 * тяжелые и Вася с Машей не могут их переставить, поэтому они окунают кисть в ведро и уже с этой кистью идут красить дерево.
 * Краска на кисти из ведра Васи засыхает, когда он удаляется от ведра более чем на V метров, а из ведра Маши — на M метров.
 * Определите, сколько деревьев может быть покрашено.
 */
public class TaskA {
    public static void main(String[] args) {

    }
}
