package org.parog.session1;

/**
 * Миша сидел на занятиях математики в Высшей школе экономики и решал следующую задачу: дано n целых чисел и нужно
 * расставить между ними знаки + и × так, чтобы результат полученного арифметического выражения был нечётным
 * (например, между числами 5, 7, 2, можно расставить арифметические знаки следующим образом: 5×7+2=37).
 * Так как примеры становились все больше и больше, а Миша срочно убегает в гости, от вас требуется написать программу
 * решающую данную задачу.
 */
public class TaskF {
    public static void main(String[] args) {

    }
}
